AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo5a/regs/am_mcu_apollo5a_otpinfoc.h
// #### INTERNAL BEGIN ####
//
// Generated by infoGen.py/regMacro.py
//
// Block:       OTP_INFOC
// Chip:        Apollo5a
// Summary:     OTP1 INFOC Registers
// Description: This document details the contents of the Apollo5 OTP1 INFOC registers.
//
// #### INTERNAL END ####
//*****************************************************************************
//
//  am_mcu_apollo5a_otp_infoc.h
//
//*****************************************************************************

//*****************************************************************************
//
// ${copyright}
//
// This is part of revision ${version} of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_OTP_INFOC_H
#define AM_REG_OTP_INFOC_H

#define AM_REG_OTP_INFOC_BASEADDR 0x400C2000
#define AM_REG_OTP_INFOCn(n) 0x400C2000

#define AM_REG_OTP_INFOC_ROT0_O 0x00000044
#define AM_REG_OTP_INFOC_ROT0_ADDR 0x400c2044
#define AM_REG_OTP_INFOC_ROT1_O 0x00000048
#define AM_REG_OTP_INFOC_ROT1_ADDR 0x400c2048
#define AM_REG_OTP_INFOC_ROT2_O 0x0000004c
#define AM_REG_OTP_INFOC_ROT2_ADDR 0x400c204c
#define AM_REG_OTP_INFOC_ROT3_O 0x00000050
#define AM_REG_OTP_INFOC_ROT3_ADDR 0x400c2050
#define AM_REG_OTP_INFOC_ROT4_O 0x00000054
#define AM_REG_OTP_INFOC_ROT4_ADDR 0x400c2054
#define AM_REG_OTP_INFOC_ROT5_O 0x00000058
#define AM_REG_OTP_INFOC_ROT5_ADDR 0x400c2058
#define AM_REG_OTP_INFOC_ROT6_O 0x0000005c
#define AM_REG_OTP_INFOC_ROT6_ADDR 0x400c205c
#define AM_REG_OTP_INFOC_ROT7_O 0x00000060
#define AM_REG_OTP_INFOC_ROT7_ADDR 0x400c2060
#define AM_REG_OTP_INFOC_KCP0_O 0x00000064
#define AM_REG_OTP_INFOC_KCP0_ADDR 0x400c2064
#define AM_REG_OTP_INFOC_KCP1_O 0x00000068
#define AM_REG_OTP_INFOC_KCP1_ADDR 0x400c2068
#define AM_REG_OTP_INFOC_KCP2_O 0x0000006c
#define AM_REG_OTP_INFOC_KCP2_ADDR 0x400c206c
#define AM_REG_OTP_INFOC_KCP3_O 0x00000070
#define AM_REG_OTP_INFOC_KCP3_ADDR 0x400c2070
#define AM_REG_OTP_INFOC_KCE0_O 0x00000074
#define AM_REG_OTP_INFOC_KCE0_ADDR 0x400c2074
#define AM_REG_OTP_INFOC_KCE1_O 0x00000078
#define AM_REG_OTP_INFOC_KCE1_ADDR 0x400c2078
#define AM_REG_OTP_INFOC_KCE2_O 0x0000007c
#define AM_REG_OTP_INFOC_KCE2_ADDR 0x400c207c
#define AM_REG_OTP_INFOC_KCE3_O 0x00000080
#define AM_REG_OTP_INFOC_KCE3_ADDR 0x400c2080
#define AM_REG_OTP_INFOC_OEMPROGFLAGS_O 0x00000084
#define AM_REG_OTP_INFOC_OEMPROGFLAGS_ADDR 0x400c2084
#define AM_REG_OTP_INFOC_HBK1MINVER0_O 0x00000090
#define AM_REG_OTP_INFOC_HBK1MINVER0_ADDR 0x400c2090
#define AM_REG_OTP_INFOC_HBK1MINVER1_O 0x00000094
#define AM_REG_OTP_INFOC_HBK1MINVER1_ADDR 0x400c2094
#define AM_REG_OTP_INFOC_HBK1MINVER2_O 0x00000098
#define AM_REG_OTP_INFOC_HBK1MINVER2_ADDR 0x400c2098
#define AM_REG_OTP_INFOC_SECURITY_O 0x0000009c
#define AM_REG_OTP_INFOC_SECURITY_ADDR 0x400c209c
#define AM_REG_OTP_INFOC_LOCKMASK0_O 0x000000a0
#define AM_REG_OTP_INFOC_LOCKMASK0_ADDR 0x400c20a0
#define AM_REG_OTP_INFOC_LOCKMASK1_O 0x000000a4
#define AM_REG_OTP_INFOC_LOCKMASK1_ADDR 0x400c20a4
#define AM_REG_OTP_INFOC_LOCKMASK2_O 0x000000a8
#define AM_REG_OTP_INFOC_LOCKMASK2_ADDR 0x400c20a8
#define AM_REG_OTP_INFOC_LOCKMASK3_O 0x000000ac
#define AM_REG_OTP_INFOC_LOCKMASK3_ADDR 0x400c20ac
#define AM_REG_OTP_INFOC_SBL_WPROT0_O 0x00000200
#define AM_REG_OTP_INFOC_SBL_WPROT0_ADDR 0x400c2200
#define AM_REG_OTP_INFOC_SBL_WPROT1_O 0x00000204
#define AM_REG_OTP_INFOC_SBL_WPROT1_ADDR 0x400c2204
#define AM_REG_OTP_INFOC_SBL_WPROT2_O 0x00000208
#define AM_REG_OTP_INFOC_SBL_WPROT2_ADDR 0x400c2208
#define AM_REG_OTP_INFOC_SBL_WPROT3_O 0x0000020c
#define AM_REG_OTP_INFOC_SBL_WPROT3_ADDR 0x400c220c
#define AM_REG_OTP_INFOC_SBL_WPROT4_O 0x00000210
#define AM_REG_OTP_INFOC_SBL_WPROT4_ADDR 0x400c2210
#define AM_REG_OTP_INFOC_SBL_WPROT5_O 0x00000214
#define AM_REG_OTP_INFOC_SBL_WPROT5_ADDR 0x400c2214
#define AM_REG_OTP_INFOC_SBL_WPROT6_O 0x00000218
#define AM_REG_OTP_INFOC_SBL_WPROT6_ADDR 0x400c2218
#define AM_REG_OTP_INFOC_SBL_WPROT7_O 0x0000021c
#define AM_REG_OTP_INFOC_SBL_WPROT7_ADDR 0x400c221c
#define AM_REG_OTP_INFOC_SBL_RPROT0_O 0x00000220
#define AM_REG_OTP_INFOC_SBL_RPROT0_ADDR 0x400c2220
#define AM_REG_OTP_INFOC_SBL_RPROT1_O 0x00000224
#define AM_REG_OTP_INFOC_SBL_RPROT1_ADDR 0x400c2224
#define AM_REG_OTP_INFOC_SBL_RPROT2_O 0x00000228
#define AM_REG_OTP_INFOC_SBL_RPROT2_ADDR 0x400c2228
#define AM_REG_OTP_INFOC_SBL_RPROT3_O 0x0000022c
#define AM_REG_OTP_INFOC_SBL_RPROT3_ADDR 0x400c222c
#define AM_REG_OTP_INFOC_SBL_RPROT4_O 0x00000230
#define AM_REG_OTP_INFOC_SBL_RPROT4_ADDR 0x400c2230
#define AM_REG_OTP_INFOC_SBL_RPROT5_O 0x00000234
#define AM_REG_OTP_INFOC_SBL_RPROT5_ADDR 0x400c2234
#define AM_REG_OTP_INFOC_SBL_RPROT6_O 0x00000238
#define AM_REG_OTP_INFOC_SBL_RPROT6_ADDR 0x400c2238
#define AM_REG_OTP_INFOC_SBL_RPROT7_O 0x0000023c
#define AM_REG_OTP_INFOC_SBL_RPROT7_ADDR 0x400c223c
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_O 0x00000240
#define AM_REG_OTP_INFOC_DCU_DISABLEOVERRIDE_ADDR 0x400c2240
#define AM_REG_OTP_INFOC_SEC_POL_O 0x0000024c
#define AM_REG_OTP_INFOC_SEC_POL_ADDR 0x400c224c
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_O 0x00000250
#define AM_REG_OTP_INFOC_BOOT_OVERRIDE_ADDR 0x400c2250
#define AM_REG_OTP_INFOC_WIRED_CONFIG_O 0x00000254
#define AM_REG_OTP_INFOC_WIRED_CONFIG_ADDR 0x400c2254
#define AM_REG_OTP_INFOC_CUST_WPROT0_O 0x00000258
#define AM_REG_OTP_INFOC_CUST_WPROT0_ADDR 0x400c2258
#define AM_REG_OTP_INFOC_CUST_WPROT1_O 0x0000025c
#define AM_REG_OTP_INFOC_CUST_WPROT1_ADDR 0x400c225c
#define AM_REG_OTP_INFOC_CUST_WPROT2_O 0x00000260
#define AM_REG_OTP_INFOC_CUST_WPROT2_ADDR 0x400c2260
#define AM_REG_OTP_INFOC_CUST_WPROT3_O 0x00000264
#define AM_REG_OTP_INFOC_CUST_WPROT3_ADDR 0x400c2264
#define AM_REG_OTP_INFOC_CUST_WPROT4_O 0x00000268
#define AM_REG_OTP_INFOC_CUST_WPROT4_ADDR 0x400c2268
#define AM_REG_OTP_INFOC_CUST_WPROT5_O 0x0000026c
#define AM_REG_OTP_INFOC_CUST_WPROT5_ADDR 0x400c226c
#define AM_REG_OTP_INFOC_CUST_WPROT6_O 0x00000270
#define AM_REG_OTP_INFOC_CUST_WPROT6_ADDR 0x400c2270
#define AM_REG_OTP_INFOC_CUST_WPROT7_O 0x00000274
#define AM_REG_OTP_INFOC_CUST_WPROT7_ADDR 0x400c2274
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_O 0x00000278
#define AM_REG_OTP_INFOC_CUSTOTP_PROGLOCK_ADDR 0x400c2278
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_O 0x0000027c
#define AM_REG_OTP_INFOC_CUSTOTP_RDLOCK_ADDR 0x400c227c
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_O 0x00000280
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY0_ADDR 0x400c2280
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_O 0x00000284
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY1_ADDR 0x400c2284
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_O 0x00000288
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY2_ADDR 0x400c2288
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_O 0x0000028c
#define AM_REG_OTP_INFOC_CUSTOTP_READ_KEY3_ADDR 0x400c228c
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_O 0x00000290
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY0_ADDR 0x400c2290
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_O 0x00000294
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY1_ADDR 0x400c2294
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_O 0x00000298
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY2_ADDR 0x400c2298
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_O 0x0000029c
#define AM_REG_OTP_INFOC_CUSTOTP_PROG_KEY3_ADDR 0x400c229c
#define AM_REG_OTP_INFOC_CUST_RPROT0_O 0x000002a0
#define AM_REG_OTP_INFOC_CUST_RPROT0_ADDR 0x400c22a0
#define AM_REG_OTP_INFOC_CUST_RPROT1_O 0x000002a4
#define AM_REG_OTP_INFOC_CUST_RPROT1_ADDR 0x400c22a4
#define AM_REG_OTP_INFOC_CUST_RPROT2_O 0x000002a8
#define AM_REG_OTP_INFOC_CUST_RPROT2_ADDR 0x400c22a8
#define AM_REG_OTP_INFOC_CUST_RPROT3_O 0x000002ac
#define AM_REG_OTP_INFOC_CUST_RPROT3_ADDR 0x400c22ac
#define AM_REG_OTP_INFOC_CUST_RPROT4_O 0x000002b0
#define AM_REG_OTP_INFOC_CUST_RPROT4_ADDR 0x400c22b0
#define AM_REG_OTP_INFOC_CUST_RPROT5_O 0x000002b4
#define AM_REG_OTP_INFOC_CUST_RPROT5_ADDR 0x400c22b4
#define AM_REG_OTP_INFOC_CUST_RPROT6_O 0x000002b8
#define AM_REG_OTP_INFOC_CUST_RPROT6_ADDR 0x400c22b8
#define AM_REG_OTP_INFOC_CUST_RPROT7_O 0x000002bc
#define AM_REG_OTP_INFOC_CUST_RPROT7_ADDR 0x400c22bc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_O 0x000002c0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY0_ADDR 0x400c22c0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_O 0x000002c4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY1_ADDR 0x400c22c4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_O 0x000002c8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY2_ADDR 0x400c22c8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_O 0x000002cc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY3_ADDR 0x400c22cc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_O 0x000002d0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY4_ADDR 0x400c22d0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_O 0x000002d4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY5_ADDR 0x400c22d4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_O 0x000002d8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY6_ADDR 0x400c22d8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_O 0x000002dc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY7_ADDR 0x400c22dc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_O 0x000002e0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY8_ADDR 0x400c22e0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_O 0x000002e4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY9_ADDR 0x400c22e4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_O 0x000002e8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY10_ADDR 0x400c22e8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_O 0x000002ec
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY11_ADDR 0x400c22ec
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_O 0x000002f0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY12_ADDR 0x400c22f0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_O 0x000002f4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY13_ADDR 0x400c22f4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_O 0x000002f8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY14_ADDR 0x400c22f8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_O 0x000002fc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT0_KEY15_ADDR 0x400c22fc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_O 0x00000300
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY0_ADDR 0x400c2300
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_O 0x00000304
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY1_ADDR 0x400c2304
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_O 0x00000308
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY2_ADDR 0x400c2308
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_O 0x0000030c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY3_ADDR 0x400c230c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_O 0x00000310
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY4_ADDR 0x400c2310
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_O 0x00000314
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY5_ADDR 0x400c2314
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_O 0x00000318
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY6_ADDR 0x400c2318
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_O 0x0000031c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY7_ADDR 0x400c231c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_O 0x00000320
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY8_ADDR 0x400c2320
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_O 0x00000324
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY9_ADDR 0x400c2324
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_O 0x00000328
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY10_ADDR 0x400c2328
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_O 0x0000032c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY11_ADDR 0x400c232c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_O 0x00000330
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY12_ADDR 0x400c2330
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_O 0x00000334
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY13_ADDR 0x400c2334
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_O 0x00000338
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY14_ADDR 0x400c2338
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_O 0x0000033c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT1_KEY15_ADDR 0x400c233c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_O 0x00000340
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY0_ADDR 0x400c2340
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_O 0x00000344
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY1_ADDR 0x400c2344
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY2_O 0x00000348
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY2_ADDR 0x400c2348
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY3_O 0x0000034c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY3_ADDR 0x400c234c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY4_O 0x00000350
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY4_ADDR 0x400c2350
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY5_O 0x00000354
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY5_ADDR 0x400c2354
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY6_O 0x00000358
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY6_ADDR 0x400c2358
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY7_O 0x0000035c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY7_ADDR 0x400c235c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY8_O 0x00000360
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY8_ADDR 0x400c2360
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY9_O 0x00000364
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY9_ADDR 0x400c2364
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY10_O 0x00000368
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY10_ADDR 0x400c2368
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY11_O 0x0000036c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY11_ADDR 0x400c236c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY12_O 0x00000370
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY12_ADDR 0x400c2370
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY13_O 0x00000374
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY13_ADDR 0x400c2374
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY14_O 0x00000378
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY14_ADDR 0x400c2378
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY15_O 0x0000037c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT2_KEY15_ADDR 0x400c237c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY0_O 0x00000380
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY0_ADDR 0x400c2380
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_O 0x00000384
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY1_ADDR 0x400c2384
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_O 0x00000388
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY2_ADDR 0x400c2388
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_O 0x0000038c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY3_ADDR 0x400c238c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_O 0x00000390
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY4_ADDR 0x400c2390
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_O 0x00000394
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY5_ADDR 0x400c2394
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_O 0x00000398
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY6_ADDR 0x400c2398
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_O 0x0000039c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY7_ADDR 0x400c239c
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_O 0x000003a0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY8_ADDR 0x400c23a0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_O 0x000003a4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY9_ADDR 0x400c23a4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_O 0x000003a8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY10_ADDR 0x400c23a8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_O 0x000003ac
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY11_ADDR 0x400c23ac
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_O 0x000003b0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY12_ADDR 0x400c23b0
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_O 0x000003b4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY13_ADDR 0x400c23b4
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_O 0x000003b8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY14_ADDR 0x400c23b8
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_O 0x000003bc
#define AM_REG_OTP_INFOC_KEYBANK_CUST_QUADRANT3_KEY15_ADDR 0x400c23bc
#define AM_REG_OTP_INFOC_RSVD_FF_O 0x000003fc
#define AM_REG_OTP_INFOC_RSVD_FF_ADDR 0x400c23fc

// ROT0 - Word 0 (bits 31:0) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT0_ROT0_S 0
#define AM_REG_OTP_INFOC_ROT0_ROT0_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT0_ROT0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT0_ROT0_Pos 0
#define AM_REG_OTP_INFOC_ROT0_ROT0_Msk 0xFFFFFFFF

// ROT1 - Word 1 (bits 63:32) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT1_ROT1_S 0
#define AM_REG_OTP_INFOC_ROT1_ROT1_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT1_ROT1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT1_ROT1_Pos 0
#define AM_REG_OTP_INFOC_ROT1_ROT1_Msk 0xFFFFFFFF

// ROT2 - Word 2 (bits 95:64) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT2_ROT2_S 0
#define AM_REG_OTP_INFOC_ROT2_ROT2_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT2_ROT2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT2_ROT2_Pos 0
#define AM_REG_OTP_INFOC_ROT2_ROT2_Msk 0xFFFFFFFF

// ROT3 - Word 3 (bits 127:96) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT3_ROT3_S 0
#define AM_REG_OTP_INFOC_ROT3_ROT3_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT3_ROT3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT3_ROT3_Pos 0
#define AM_REG_OTP_INFOC_ROT3_ROT3_Msk 0xFFFFFFFF

// ROT4 - Word 4 (bits 159:128) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT4_ROT4_S 0
#define AM_REG_OTP_INFOC_ROT4_ROT4_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT4_ROT4(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT4_ROT4_Pos 0
#define AM_REG_OTP_INFOC_ROT4_ROT4_Msk 0xFFFFFFFF

// ROT5 - Word 5 (bits 191:160) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT5_ROT5_S 0
#define AM_REG_OTP_INFOC_ROT5_ROT5_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT5_ROT5(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT5_ROT5_Pos 0
#define AM_REG_OTP_INFOC_ROT5_ROT5_Msk 0xFFFFFFFF

// ROT6 - Word 6 (bits 223:192) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT6_ROT6_S 0
#define AM_REG_OTP_INFOC_ROT6_ROT6_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT6_ROT6(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT6_ROT6_Pos 0
#define AM_REG_OTP_INFOC_ROT6_ROT6_Msk 0xFFFFFFFF

// ROT7 - Word 7 (bits 255:224) of the 256-bit ROT
#define AM_REG_OTP_INFOC_ROT7_ROT7_S 0
#define AM_REG_OTP_INFOC_ROT7_ROT7_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_ROT7_ROT7(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_ROT7_ROT7_Pos 0
#define AM_REG_OTP_INFOC_ROT7_ROT7_Msk 0xFFFFFFFF

// KCP0 - Word 0 (bits 32:0) of the 128-bit KCP
#define AM_REG_OTP_INFOC_KCP0_KCP0_S 0
#define AM_REG_OTP_INFOC_KCP0_KCP0_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KCP0_KCP0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KCP0_KCP0_Pos 0
#define AM_REG_OTP_INFOC_KCP0_KCP0_Msk 0xFFFFFFFF

// KCP1 - Word 1 (bits 63:32) of the 128-bit KCP
#define AM_REG_OTP_INFOC_KCP1_KCP1_S 0
#define AM_REG_OTP_INFOC_KCP1_KCP1_M 0xFFFFFFFF
#define AM_REG_OTP_INFOC_KCP1_KCP1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFOC_KCP1_KCP1_Pos 0
#define AM_REG_OTP_INFOC_KCP1_KCP1_Msk 0xFFFFFFFF

